{
    "logo": "Shopping Phone",
    "public_header_a_1": "Home",
    "public_header_a_2": "About",
    "public_header_a_3": "About Admin",
    "language_select": "Language",
    "home_page_title": "Hello Se'r",
    "home_page_welcome": "Welcome the Phone Shopping !",
    "home_page_text": "In this program, you can advertise your product according to the categories and you can update it later or buy the products entered by others. If you want to know about category and admin side",
    "batafsil": "More",
    "home_page_batafsil_text": "click on it or if you want to work in the program ",
    "home_page_register": "Register",
    "public_about_title": "About it's Programm",
    "public_about_text": "The focus of the program is on the Front-end part of the Web-programming area, where the server is also located. JSON-server and JSON-server-auth are used for the server. Even the purchase parts do not use BECKEND and are written in clean React code. The program uses React's React-Router, React-use-Cart, React-use-form, Formik, and Nested Routes. Axios and Fetch technologies were used for requests. Only one person can be an Admin in the program, and he is the author himself, he can add categories, and according to those categories, customers can place ads and buy.",
    "public_about_admin_title": "About Admin",
    "public_about_admin_text_title": "Avtor",
    "public_about_admin_text": "The developer is a web developer who works in front-end programming and is educated at Najot Ta'lim. Knowledge of HTML + CSS, Sass, Bootstrap, Javascript, React, Redux, Git Git-hub. There is no exact information about the age. The creator of the program works at the Programmer.uz company, at the Youth Technopark of the Samarkand region, and now at the Empire IT Academy. In the program, categories are added through the admin panel, and customers can buy and advertise only products included in the categories. To use",
    "public_about_admin_register": "registration"   ,
    "register_title": "Registration",
    "register_name_placeholder": "Name",
    "register_familya_placeholder": "Lastname",
    "register_email_placeholder": "Email",
    "register_password_placeholder": "Password",
    "name_required": "Name required",
    "familya_required": "Lastname required",
    "email_invalid": "Email invalid",
    "email_required": "Email required",
    "password_required": "Password required",
    "submit": "Submit" ,
    "category_name": "Category name required",
    "category_model": "Category model required",
    "add_category": "Add category + ",
    "edit": "Edit",
    "delete": "Delete"
}