{
    "logo": "Telefon Bozor",
    "public_header_a_1": "Bosh-sahifa",
    "public_header_a_2": "Dastur haqida",
    "public_header_a_3": "Admin haqida",
    "language_select": "Til",
    "home_page_title": "Assalomu Aleykum",
    "home_page_welcome": "Telefon Bozorga hush kelibsiz",
    "home_page_welcome_text": "Telefon bozor dasturiga hush kelibsiz !",
    "home_page_text": "Bu dasturda siz  o'z mahsulotingizni category larga tugri kelsa  e'lon berishingiz mumkin va uni keyinchalik yangilash yoki boshqalar kiritgan mahsulotlarni harid qilishingiz mumkin. Category va admin tomoni haqida ma'lumot olmoqchi bo'lsangiz ",
    "batafsil": "Batafsil",
    "home_page_batafsil_text": "ustiga bosing yoki dasturda ishlamoqchi bo'lsangiz ",
    "home_page_register": "Ro'yhattan o'ting",
    "public_about_title": "Dastur haqida",
    "public_about_text": "Dasturda focus Web-dasturlash sohasining Front-end qismiga qaratilgan bo'lib u server ham o'sha joyda joylashgan hisoblanadi. Server uchun JSON-server va JSON-server-auth dan foydalanilgan. Hattoki sotib olish qismlarida ham BECKEND ishlatilinmagan va toza React code yozilgan. Dasturda Reactning React-Router, React-use-Cart, React-use-form, Formik, va Nested Route lar ishlatilgan. Surovlar uchun esa Axios va Fetch texnalogiyalaridan foydalanilgan. Dasturda faqat bir kishi Admin bo'la oladi va u ham autorning o'zi bo'lib u categorylar qo'sha oladi va o'sha categorylarga qarab mijozlar e'lon joylashtiradi va sotib oladi .",
    "public_about_admin_title": "Admin haqida",
    "public_about_admin_text_title": "Yaratuvchi",
    "public_about_admin_text": "Dastur yataruvchisi Web dasturchi bo'lib u dasturlashning Front end sohasida ishlab kelmoqda va Najot ta'lim da tahsil olgan hisoblanadi. Bilim HTML + CSS, Sass, Bootstrap, Javascript, React, Redux, Git Git-hub. Yosh haqida esa aniq ma'lumot yuq. Dastur yaratuvchisi Programmer.uz kompaniyasida, Samarqand viloyati Yoshlar TexnoParkida, va hozirda Empire IT academiyasida o'z faoliyatini yuritadi. Dasturda admin paneli orqali category qushiladi va mijozlar faqat categorylarga kiritilgan mahsulotlardangina sotib olishlari va e'lon berishlari mumkin. Foydanalish uchun",
    "public_about_admin_register": "ruyhattan o'ting",
    "register_title": "Ro'yhattan o'ting",
    "register_name_placeholder": "Ismingizni kiriting",
    "register_familya_placeholder": "Familyangizni kiriting",
    "register_email_placeholder": "Emailingizni kiriting",
    "register_password_placeholder": "Parolingizni kiriting",
    "name_required": "Ism majburiy",
    "familya_required": "Familya majburiy",
    "email_invalid": "Email yozilishi xato",
    "email_required": "Email majburiy",
    "password_required": "Parol majburiy",
    "submit": "Jo'natish",
    "category_name": "Category ismi majburiy",
    "category_model": "Category modeli majburiy",
    "add_category": "Category qushish + ",
    "edit": "Yangilash",
    "delete": "O'chirish"
}